       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLSUBPROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LK-NAME PIC X(20).

       PROCEDURE DIVISION USING LK-NAME.

       MAIN-PROCEDURE.
           DISPLAY "HELLO " LK-NAME.
           STOP RUN.
       END PROGRAM CALLSUBPROGRAM.
